Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/housing_taxes_and_reliefs/index.html.txt.tmx
Source language: en
Languages: ga

source: Housing taxes and reliefs
ga: Cánacha agus faoisimh a bhaineann le tithíocht

source: Local Property Tax (LPT)
ga: Cáin Mhaoine Áitiúil (CMÁ)

source: The Local Property Tax (LPT) is payable on residential property
ga: Tá an Cháin Mhaoine Áitiúil (CMÁ) le híoc ar mhaoin chónaithe

source: It is collected by Revenue
ga: Bailíonn na Coimisinéirí Ioncaim í

source: Paying the Local Property Tax (LPT)
ga: An Cháin Mhaoine Áitiúil (CMÁ) a Íoc

source: You can pay your Local Property Tax (LPT) in a variety of ways
ga: Féadfaidh tú do Cháin Mhaoine Áitiúil (CMÁ) a íoc ar roinnt bealaí

source: This document covers your options
ga: Cuimsítear sa cháipéis seo do chuid roghanna

source: Deferring payment of the Local Property Tax
ga: Íocaíocht na Cánach Maoine Áitiúla a Iarchur

source: The Local Property Tax is a tax payable on residential property
ga: Cáin atá sa Cháin Mhaoine Áitiúil atá le híoc ar mhaoin chónaithe

source: This document gives information about who qualifies for deferral and how to defer payment of the tax
ga: Tugtar faisnéis sa cháipéis seo faoi na daoine a cháilíonn d’iarchur agus conas íocaíocht na cánach a iarchur

source: Exemptions from Local Property Tax
ga: Díolúintí ón gCáin Mhaoine Áitiúil

source: This document gives information about properties that are exempt from the tax
ga: Tugtar faisnéis sa cháipéis seo faoi mhaoin atá díolmhaithe ón gcáin

source: Housing tax credits and reliefs
ga: Faoisimh agus creidmheasanna cánach i leith tithíochta

source: It is possible to claim tax relief on certain housing expenses. Find out more
ga: Féadfar faoiseamh cánach a éileamh ar réimse chostais tí

source: This document is in: Money and Tax > Tax > Income tax credits and reliefs
ga: This document is in: Airgead agus Cáin > Cáin > Creidmheasanna agus faoiseamh cáin ioncaim

source: Stamp duty on property
ga: Dleacht stampála ar réadmhaoin

source: Stamp duty is payable on the transfer of property
ga: Tá dleacht stampála iníoctha ar aistriú réadmhaoine

source: This document is in: Housing > Owning a home > Buying a home
ga: This document is in: Tithíocht > Ag ceannach tí > Teach a cheannach

source: Tax relief on mortgage interest payments is no longer available for new purchasers since 31 December 2012
ga: Ní cheadaítear aon fhaoiseamh cánach ar ús morgáiste le haghaidh morgáistí a glacadh i ndiaidh an 31 Nollaig 2012

source: Renting out a room in your home
ga: Ag ligean seomra i do theach amach ar cíos

source: Rent-a-room relief makes it possible to earn tax-free rental income when you rent out a room in your home to private tenants
ga: Is féidir seomra i do theach a ligean ar cíos agus faoiseamh cánach a fháil

source: This document is in: Housing > Owning a home > Home owners
ga: This document is in: Tithíocht > Ag ceannach tí > Seilbh tí

source: The Household Charge has been replaced by the Local Property Tax (LPT). Unpaid Household Charge is now being collected through the LPT system
ga: Tá Cáin Mhaoine Áitiúil ar mhaoin chónaithe ag teacht in ionad an Mhuirir eatramhaigh Theaghlaigh a tugadh isteach in 2012

source: Non-Principal Private Residence Charge (NPPR)
ga: Muirear ar Áit Chónaithe Phríobháideach Neamhphríomha (NPPR)

source: The NPPR charge has been abolished but late fees apply to unpaid amounts. Further penalties apply to amounts that were still outstanding on 1 September 2014
ga: An muirear rialtais áitiúil bliantúil ar áit chónaithe phríobháideach neamhphríomha, mar shampla réadmhaoin phríobháideach ar cíos agus tithe saoire

source: Tax issues for tenants
ga: Saincheisteanna cánach do thionóntaí

source: Describes the rules on tax relief for private tenants, which is being phased out. Also covers the requirement to deduct tax from your rent payments if your landlord lives abroad, unless you pay rent through an agent
ga: Déantar cur síos ar fhaoiseamh cánach le haghaidh tionóntaí príobháideacha (a bhfuil deireadh á chur leis) agus ar an ngá chun cáin a asbhaint ó d’íocaíochtaí cíosa má íocann tú an cíos go díreach le tiarna talún a chónaíonn thar lear

source: This document is in: Housing > Renting a home
ga: This document is in: Tithíocht > Teach a fháil ar chíos

source: Most Read in "Money and Tax"
ga: Ábhar is mó éilimh i "Airgead agus Cáin"

source: How your income tax is calculated
ga: An córas le cáin a mheas

source: Universal Social Charge (USC)
ga: Muirear Sóisialta Uilíoch (MSU)

source: Introduction to income tax credits and reliefs
ga: Réamhrá ar chreidmheasanna cánach agus faoiseamh ó cháin ioncaim
